jhnphm/hexbright/hardware/hexbright/boards.txt
##############################################################

hexbright.name=Hexbright

hexbright.upload.protocol=arduino
hexbright.upload.maximum_size=14336
hexbright.upload.speed=19200

hexbright.bootloader.low_fuses=0xe2
hexbright.bootloader.high_fuses=0xdd
hexbright.bootloader.extended_fuses=0x00
hexbright.bootloader.path=hexbright:atmega
hexbright.bootloader.file=ATmegaBOOT_168_hexbright.hex
hexbright.bootloader.unlock_bits=0x3F
hexbright.bootloader.lock_bits=0x0F

hexbright.build.mcu=atmega168
hexbright.build.f_cpu=8000000L
hexbright.build.core=arduino
hexbright.build.variant=standard


##############################################################

hexbright_tiny.name=Hexbright Tinyboot

hexbright_tiny.upload.protocol=arduino
hexbright_tiny.upload.maximum_size=15360
hexbright_tiny.upload.speed=19200

hexbright_tiny.bootloader.low_fuses=0xe2
hexbright_tiny.bootloader.high_fuses=0xdd
hexbright_tiny.bootloader.extended_fuses=0x02
hexbright_tiny.bootloader.path=hexbright:atmega
hexbright_tiny.bootloader.file=ATmegaBOOT_168_hexbright_tiny.hex
hexbright_tiny.bootloader.unlock_bits=0x3F
hexbright_tiny.bootloader.lock_bits=0x0F

hexbright_tiny.build.mcu=atmega168p
hexbright_tiny.build.f_cpu=8000000L
hexbright_tiny.build.core=arduino
hexbright_tiny.build.variant=standard


